#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform
aws_sns_topic.notification_topic: Refreshing state... [id=arn:aws:sns:eu-west-1:877118445951:sre-grafana-lambda-notifications]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/877118445951/sre-grafana-lambda-dlq]
aws_iam_role.lambda_role: Refreshing state... [id=sre-grafana-lambda-role]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=sre-grafana-lambda-role-20230408235151866100000001]
aws_cloudwatch_metric_alarm.dlq_alarm: Refreshing state... [id=sre-grafana-lambda-dlq-alarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.sre-grafana-lambda will be created
  + resource "aws_lambda_function" "sre-grafana-lambda" {
      + arn                            = (known after apply)
      + filename                       = "./../sre_grafana_lambda/handler.py"
      + function_name                  = "sre-grafana-lambda"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::877118445951:role/sre-grafana-lambda-role"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Julia Paiva"
          + "Project"   = "SRE-GRAFANA"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:eu-west-1:877118445951:sre-grafana-lambda-dlq"
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @juliavpaiva, Action: `pull_request`, Working Directory: `infrastructure/terraform/main`, Workflow: `Plan Terraform Main`*